### Terraform `plan` Succeeded for Workspace: `default` 
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.eks_infra_s3["loki"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_infra_s3" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:GetObjectTagging",
+               "s3:ListBucket",
+               "s3:PutObject",
+               "s3:PutObjectTagging",
            ]
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.eks_infra_s3["mimir"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_infra_s3" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:GetObjectTagging",
+               "s3:ListBucket",
+               "s3:PutObject",
+               "s3:PutObjectTagging",
            ]
+           resources = [
+               (known after apply),
+               (known after apply),
+               (known after apply),
+               (known after apply),
+               (known after apply),
+               (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.eks_infra_s3["tempo"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_infra_s3" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:GetObjectTagging",
+               "s3:ListBucket",
+               "s3:PutObject",
+               "s3:PutObjectTagging",
            ]
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
        }
    }

  # aws_acm_certificate.main will be created
+   resource "aws_acm_certificate" "main" {
+       arn                       = (known after apply)
+       domain_name               = "sandbox.lgtm.pvlbnkl.xyz"
+       domain_validation_options = [
+           {
+               domain_name           = "*.sandbox.lgtm.pvlbnkl.xyz"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
+           {
+               domain_name           = "sandbox.lgtm.pvlbnkl.xyz"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "*.sandbox.lgtm.pvlbnkl.xyz",
+           "sandbox.lgtm.pvlbnkl.xyz",
        ]
+       tags_all                  = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"
    }

  # aws_iam_policy.eks_infra_s3["loki"] will be created
+   resource "aws_iam_policy" "eks_infra_s3" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Access policy for eks-sandbox S3 bucket loki"
+       id               = (known after apply)
+       name             = "loki-access-policy"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
    }

  # aws_iam_policy.eks_infra_s3["mimir"] will be created
+   resource "aws_iam_policy" "eks_infra_s3" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Access policy for eks-sandbox S3 bucket mimir"
+       id               = (known after apply)
+       name             = "mimir-access-policy"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
    }

  # aws_iam_policy.eks_infra_s3["tempo"] will be created
+   resource "aws_iam_policy" "eks_infra_s3" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Access policy for eks-sandbox S3 bucket tempo"
+       id               = (known after apply)
+       name             = "tempo-access-policy"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
    }

  # aws_iam_policy.karpenter will be created
+   resource "aws_iam_policy" "karpenter" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       id               = (known after apply)
+       name             = "karpenter-hotfix"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ec2:TerminateInstances",
+                           "ec2:RunInstances",
+                           "ec2:DeleteLaunchTemplate",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
    }

  # aws_route53_record.main_acm_validation["*.sandbox.lgtm.pvlbnkl.xyz"] will be created
+   resource "aws_route53_record" "main_acm_validation" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = (known after apply)
    }

  # aws_route53_record.main_acm_validation["sandbox.lgtm.pvlbnkl.xyz"] will be created
+   resource "aws_route53_record" "main_acm_validation" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = (known after apply)
    }

  # aws_route53_record.main_ns will be created
+   resource "aws_route53_record" "main_ns" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "sandbox.lgtm.pvlbnkl.xyz"
+       records         = (known after apply)
+       ttl             = 300
+       type            = "NS"
+       zone_id         = "Z0082921TKY9N0FLNMUM"
    }

  # aws_route53_zone.main will be created
+   resource "aws_route53_zone" "main" {
+       arn                 = (known after apply)
+       comment             = "Zone for sandbox environment. Associated with EKS cluster: eks-sandbox"
+       force_destroy       = false
+       id                  = (known after apply)
+       name                = "sandbox.lgtm.pvlbnkl.xyz"
+       name_servers        = (known after apply)
+       primary_name_server = (known after apply)
+       tags_all            = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
+       zone_id             = (known after apply)
    }

  # aws_s3_bucket.eks_infra["loki"] will be created
+   resource "aws_s3_bucket" "eks_infra" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "eks-sandbox-loki"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eks_infra["mimir-alertmanager"] will be created
+   resource "aws_s3_bucket" "eks_infra" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "eks-sandbox-mimir-alertmanager"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eks_infra["mimir-blocks"] will be created
+   resource "aws_s3_bucket" "eks_infra" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "eks-sandbox-mimir-blocks"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eks_infra["mimir-ruler"] will be created
+   resource "aws_s3_bucket" "eks_infra" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "eks-sandbox-mimir-ruler"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.eks_infra["tempo"] will be created
+   resource "aws_s3_bucket" "eks_infra" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "eks-sandbox-tempo"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "coredns"
+       id                 = (known after apply)
+       kubernetes_version = "1.29"
+       version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "kube-proxy"
+       id                 = (known after apply)
+       kubernetes_version = "1.29"
+       version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "vpc-cni"
+       id                 = (known after apply)
+       kubernetes_version = "1.29"
+       version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
+       certificates = (known after apply)
+       id           = (known after apply)
+       url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
+   resource "aws_cloudwatch_log_group" "this" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/aws/eks/eks-sandbox/cluster"
+       name_prefix       = (known after apply)
+       retention_in_days = 90
+       skip_destroy      = false
+       tags              = {
+           "Name"                   = "/aws/eks/eks-sandbox/cluster"
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       tags_all          = {
+           "Environment"            = "sandbox"
+           "Name"                   = "/aws/eks/eks-sandbox/cluster"
+           "Owner"                  = "SRE"
+           "Product"                = "core"
+           "Service"                = "eks"
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["karpenter.sh/discovery"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "karpenter.sh/discovery"
+       resource_id = (known after apply)
+       value       = "eks-sandbox"
    }

  # module.eks.aws_eks_access_entry.this["AdministratorAccess"] will be created
+   resource "aws_eks_access_entry" "this" {
+       access_entry_arn  = (known after apply)
+       cluster_name      = "eks-sandbox"
+       created_at        = (known after apply)
+       id                = (known after apply)
+       kubernetes_groups = (known after apply)
+       modified_at       = (known after apply)
+       principal_arn     = "arn:aws:iam::245582572290:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_AdministratorAccess_20232cf5120c756c"
+       tags              = {
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       tags_all          = {
+           "Environment"            = "sandbox"
+           "Owner"                  = "SRE"
+           "Product"                = "core"
+           "Service"                = "eks"
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       type              = "STANDARD"
+       user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_entry.this["cicd"] will be created
+   resource "aws_eks_access_entry" "this" {
+       access_entry_arn  = (known after apply)
+       cluster_name      = "eks-sandbox"
+       created_at        = (known after apply)
+       id                = (known after apply)
+       kubernetes_groups = (known after apply)
+       modified_at       = (known after apply)
+       principal_arn     = "arn:aws:iam::245582572290:role/lgtm-GHA"
+       tags              = {
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       tags_all          = {
+           "Environment"            = "sandbox"
+           "Owner"                  = "SRE"
+           "Product"                = "core"
+           "Service"                = "eks"
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       type              = "STANDARD"
+       user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["AdministratorAccess_admin"] will be created
+   resource "aws_eks_access_policy_association" "this" {
+       associated_at = (known after apply)
+       cluster_name  = "eks-sandbox"
+       id            = (known after apply)
+       modified_at   = (known after apply)
+       policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
+       principal_arn = "arn:aws:iam::245582572290:role/aws-reserved/sso.amazonaws.com/AWSReservedSSO_AdministratorAccess_20232cf5120c756c"

+       access_scope {
+           type = "cluster"
        }
    }

  # module.eks.aws_eks_access_policy_association.this["cicd_admin"] will be created
+   resource "aws_eks_access_policy_association" "this" {
+       associated_at = (known after apply)
+       cluster_name  = "eks-sandbox"
+       id            = (known after apply)
+       modified_at   = (known after apply)
+       policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
+       principal_arn = "arn:aws:iam::245582572290:role/lgtm-GHA"

+       access_scope {
+           type = "cluster"
        }
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "coredns"
+       addon_version               = "v1.11.1-eksbuild.8"
+       arn                         = (known after apply)
+       cluster_name                = "eks-sandbox"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       tags_all                    = {
+           "Environment"            = "sandbox"
+           "Owner"                  = "SRE"
+           "Product"                = "core"
+           "Service"                = "eks"
+           "karpenter.sh/discovery" = "eks-sandbox"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "kube-proxy"
+       addon_version               = "v1.29.1-eksbuild.2"
+       arn                         = (known after apply)
+       cluster_name                = "eks-sandbox"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       tags_all                    = {
+           "Environment"            = "sandbox"
+           "Owner"                  = "SRE"
+           "Product"                = "core"
+           "Service"                = "eks"
+           "karpenter.sh/discovery" = "eks-sandbox"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "vpc-cni"
+       addon_version               = "v1.18.1-eksbuild.1"
+       arn                         = (known after apply)
+       cluster_name                = "eks-sandbox"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       tags_all                    = {
+           "Environment"            = "sandbox"
+           "Owner"                  = "SRE"
+           "Product"                = "core"
+           "Service"                = "eks"
+           "karpenter.sh/discovery" = "eks-sandbox"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] will be created
+   resource "aws_eks_cluster" "this" {
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = [
+           "api",
+           "audit",
+           "authenticator",
+           "controllerManager",
+           "scheduler",
        ]
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       name                      = "eks-sandbox"
+       platform_version          = (known after apply)
+       role_arn                  = (known after apply)
+       status                    = (known after apply)
+       tags                      = {
+           "karpenter.sh/discovery" = "eks-sandbox"
+           "terraform-aws-modules"  = "eks"
        }
+       tags_all                  = {
+           "Environment"            = "sandbox"
+           "Owner"                  = "SRE"
+           "Product"                = "core"
+           "Service"                = "eks"
+           "karpenter.sh/discovery" = "eks-sandbox"
+           "terraform-aws-modules"  = "eks"
        }
+       version                   = "1.29"

+       access_config {
+           authentication_mode                         = "API_AND_CONFIG_MAP"
+           bootstrap_cluster_creator_admin_permissions = false
        }

+       encryption_config {
+           resources = [
+               "secrets",
            ]

+           provider {
+               key_arn = (known after apply)
            }
        }

+       kubernetes_network_config {
+           ip_family         = "ipv4"
+           service_ipv4_cidr = "10.100.0.0/16"
+           service_ipv6_cidr = (known after apply)
        }

+       timeouts {}

+       vpc_config {
+           cluster_security_group_id = (known after apply)
+           endpoint_private_access   = true
+           endpoint_public_access    = true
+           public_access_cidrs       = [
+               "0.0.0.0/0",
            ]
+           security_group_ids        = (known after apply)
+           subnet_ids                = [
+               "subnet-024acee40c7e4e700",
            ]
+           vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
+   resource "aws_iam_openid_connect_provider" "oidc_provider" {
+       arn             = (known after apply)
+       client_id_list  = [
+           "sts.amazonaws.com",
        ]
+       id              = (known after apply)
+       tags            = {
+           "Name"                   = "eks-sandbox-eks-irsa"
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       tags_all        = {
+           "Environment"            = "sandbox"
+           "Name"                   = "eks-sandbox-eks-irsa"
+           "Owner"                  = "SRE"
+           "Product"                = "core"
+           "Service"                = "eks"
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       thumbprint_list = (known after apply)
+       url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
+   resource "aws_iam_policy" "cluster_encryption" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "eks-sandbox-cluster-ClusterEncryption"
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags             = {
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       tags_all         = {
+           "Environment"            = "sandbox"
+           "Owner"                  = "SRE"
+           "Product"                = "core"
+           "Service"                = "eks"
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "eks.amazonaws.com"
                        }
+                       Sid       = "EKSClusterAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "eks-sandbox-cluster-"
+       path                  = "/"
+       tags                  = {
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       tags_all              = {
+           "Environment"            = "sandbox"
+           "Owner"                  = "SRE"
+           "Product"                = "core"
+           "Service"                = "eks"
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = "eks-sandbox-cluster"
+           policy = jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = [
+                               "logs:CreateLogGroup",
                            ]
+                           Effect   = "Deny"
+                           Resource = "*"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
+   resource "aws_iam_role_policy_attachment" "cluster_encryption" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
+       role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
+       role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
+   resource "aws_security_group" "cluster" {
+       arn                    = (known after apply)
+       description            = "EKS cluster security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "eks-sandbox-cluster-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name"                   = "eks-sandbox-cluster"
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       tags_all               = {
+           "Environment"            = "sandbox"
+           "Name"                   = "eks-sandbox-cluster"
+           "Owner"                  = "SRE"
+           "Product"                = "core"
+           "Service"                = "eks"
+           "karpenter.sh/discovery" = "eks-sandbox"
        }
+       vpc_id                 = "vpc-01ab44431f5597901"
    }

  # module.eks.aws_security_group.node[0] will be created
+   resource "aws_security_group" "node" {
+       arn                    = (known after apply)
+       description            = "EKS node shared security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "eks-sandbox-node-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name"                              = "eks-sandbox-node"
+           "karpenter.sh/discovery"            = "eks-sandbox"
+           "kubernetes.io/cluster/eks-sandbox" = "owned"
        }
+       tags_all               = {
+           "Environment"                       = "sandbox"
+           "Name"                              = "eks-sandbox-node"
+           "Owner"                             = "SRE"
+           "Product"                           = "core"
+           "Service"                           = "eks"
+           "karpenter.sh/discovery"            = "eks-sandbox"
+           "kubernetes.io/cluster/eks-sandbox" = "owned"
        }
+       vpc_id                 = "vpc-01ab44431f5597901"
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
+   resource "aws_security_group_rule" "cluster" {
+       description              = "Node groups to cluster API"
+       from_port                = 443
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
+   resource "aws_security_group_rule" "node" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Allow all egress"
+       from_port                = 0
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 0
+       type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node groups"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 4443/tcp webhook"
+       from_port                = 4443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 4443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 6443/tcp webhook"
+       from_port                = 6443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 6443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 8443/tcp webhook"
+       from_port                = 8443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 8443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 9443/tcp webhook"
+       from_port                = 9443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 9443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node kubelets"
+       from_port                = 10250
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 10250
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node ingress on ephemeral ports"
+       from_port                = 1025
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 65535
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS UDP"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "udp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "ingress"
    }

  # module.eks.time_sleep.this[0] will be created
+   resource "time_sleep" "this" {
+       create_duration = "30s"
+       id              = (known after apply)
+       triggers        = {
+           "cluster_certificate_authority_data" = (known after apply)
+           "cluster_endpoint"                   = (known after apply)
+           "cluster_name"                       = "eks-sandbox"
+           "cluster_service_cidr"               = (known after apply)
+           "cluster_version"                    = "1.29"
        }
    }

  # module.irsa["aws-lb-controller"].data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRoleWithWebIdentity",
            ]
+           effect  = "Allow"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "sts.amazonaws.com",
                ]
+               variable = (known after apply)
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "system:serviceaccount:aws-lb-controller:aws-lb-controller",
                ]
+               variable = (known after apply)
            }

+           principals {
+               identifiers = [
+                   (known after apply),
                ]
+               type        = "Federated"
            }
        }
    }

  # module.irsa["aws-lb-controller"].aws_iam_policy.load_balancer_controller[0] will be created
+   resource "aws_iam_policy" "load_balancer_controller" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Provides permissions for AWS Load Balancer Controller addon"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "AmazonEKS_AWS_Load_Balancer_Controller-"
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "iam:CreateServiceLinkedRole"
+                       Condition = {
+                           StringEquals = {
+                               "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:DescribeTrustStores",
+                           "elasticloadbalancing:DescribeTargetHealth",
+                           "elasticloadbalancing:DescribeTargetGroups",
+                           "elasticloadbalancing:DescribeTargetGroupAttributes",
+                           "elasticloadbalancing:DescribeTags",
+                           "elasticloadbalancing:DescribeSSLPolicies",
+                           "elasticloadbalancing:DescribeRules",
+                           "elasticloadbalancing:DescribeLoadBalancers",
+                           "elasticloadbalancing:DescribeLoadBalancerAttributes",
+                           "elasticloadbalancing:DescribeListeners",
+                           "elasticloadbalancing:DescribeListenerCertificates",
+                           "ec2:GetCoipPoolUsage",
+                           "ec2:DescribeVpcs",
+                           "ec2:DescribeVpcPeeringConnections",
+                           "ec2:DescribeTags",
+                           "ec2:DescribeSubnets",
+                           "ec2:DescribeSecurityGroups",
+                           "ec2:DescribeNetworkInterfaces",
+                           "ec2:DescribeInternetGateways",
+                           "ec2:DescribeInstances",
+                           "ec2:DescribeCoipPools",
+                           "ec2:DescribeAvailabilityZones",
+                           "ec2:DescribeAddresses",
+                           "ec2:DescribeAccountAttributes",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action   = [
+                           "wafv2:GetWebACLForResource",
+                           "wafv2:GetWebACL",
+                           "wafv2:DisassociateWebACL",
+                           "wafv2:AssociateWebACL",
+                           "waf-regional:GetWebACLForResource",
+                           "waf-regional:GetWebACL",
+                           "waf-regional:DisassociateWebACL",
+                           "waf-regional:AssociateWebACL",
+                           "shield:GetSubscriptionState",
+                           "shield:DescribeProtection",
+                           "shield:DeleteProtection",
+                           "shield:CreateProtection",
+                           "iam:ListServerCertificates",
+                           "iam:GetServerCertificate",
+                           "cognito-idp:DescribeUserPoolClient",
+                           "acm:ListCertificates",
+                           "acm:DescribeCertificate",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action   = [
+                           "ec2:RevokeSecurityGroupIngress",
+                           "ec2:CreateSecurityGroup",
+                           "ec2:AuthorizeSecurityGroupIngress",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action    = "ec2:CreateTags"
+                       Condition = {
+                           Null         = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
+                           StringEquals = {
+                               "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
+                   {
+                       Action    = [
+                           "ec2:DeleteTags",
+                           "ec2:CreateTags",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
+                   {
+                       Action    = [
+                           "ec2:RevokeSecurityGroupIngress",
+                           "ec2:DeleteSecurityGroup",
+                           "ec2:AuthorizeSecurityGroupIngress",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = [
+                           "elasticloadbalancing:CreateTargetGroup",
+                           "elasticloadbalancing:CreateLoadBalancer",
+                           "elasticloadbalancing:AddTags",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:DeleteRule",
+                           "elasticloadbalancing:DeleteListener",
+                           "elasticloadbalancing:CreateRule",
+                           "elasticloadbalancing:CreateListener",
+                           "elasticloadbalancing:AddTags",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action    = [
+                           "elasticloadbalancing:RemoveTags",
+                           "elasticloadbalancing:AddTags",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:RemoveTags",
+                           "elasticloadbalancing:AddTags",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
+                   {
+                       Action    = [
+                           "elasticloadbalancing:SetSubnets",
+                           "elasticloadbalancing:SetSecurityGroups",
+                           "elasticloadbalancing:SetIpAddressType",
+                           "elasticloadbalancing:ModifyTargetGroupAttributes",
+                           "elasticloadbalancing:ModifyTargetGroup",
+                           "elasticloadbalancing:ModifyLoadBalancerAttributes",
+                           "elasticloadbalancing:DeleteTargetGroup",
+                           "elasticloadbalancing:DeleteLoadBalancer",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "elasticloadbalancing:AddTags"
+                       Condition = {
+                           Null         = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
+                           StringEquals = {
+                               "elasticloadbalancing:CreateAction" = [
+                                   "CreateTargetGroup",
+                                   "CreateLoadBalancer",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:RegisterTargets",
+                           "elasticloadbalancing:DeregisterTargets",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:SetWebAcl",
+                           "elasticloadbalancing:RemoveListenerCertificates",
+                           "elasticloadbalancing:ModifyRule",
+                           "elasticloadbalancing:ModifyListener",
+                           "elasticloadbalancing:AddListenerCertificates",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
    }

  # module.irsa["aws-lb-controller"].aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "eks-sandbox-aws-lb-controller"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
+       unique_id             = (known after apply)
    }

  # module.irsa["aws-lb-controller"].aws_iam_role_policy_attachment.load_balancer_controller[0] will be created
+   resource "aws_iam_role_policy_attachment" "load_balancer_controller" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "eks-sandbox-aws-lb-controller"
    }

  # module.irsa["ebs-csi"].data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRoleWithWebIdentity",
            ]
+           effect  = "Allow"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "sts.amazonaws.com",
                ]
+               variable = (known after apply)
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "system:serviceaccount:ebs-csi:ebs-csi",
                ]
+               variable = (known after apply)
            }

+           principals {
+               identifiers = [
+                   (known after apply),
                ]
+               type        = "Federated"
            }
        }
    }

  # module.irsa["ebs-csi"].aws_iam_policy.ebs_csi[0] will be created
+   resource "aws_iam_policy" "ebs_csi" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Provides permissions to manage EBS volumes via the container storage interface driver"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "AmazonEKS_EBS_CSI_Policy-"
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ec2:ModifyVolume",
+                           "ec2:EnableFastSnapshotRestores",
+                           "ec2:DetachVolume",
+                           "ec2:DescribeVolumesModifications",
+                           "ec2:DescribeVolumes",
+                           "ec2:DescribeTags",
+                           "ec2:DescribeSnapshots",
+                           "ec2:DescribeInstances",
+                           "ec2:DescribeAvailabilityZones",
+                           "ec2:CreateSnapshot",
+                           "ec2:AttachVolume",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action    = "ec2:CreateTags"
+                       Condition = {
+                           StringEquals = {
+                               "ec2:CreateAction" = [
+                                   "CreateVolume",
+                                   "CreateSnapshot",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
+                   {
+                       Action   = "ec2:DeleteTags"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/kubernetes.io/created-for/pvc/name" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
    }

  # module.irsa["ebs-csi"].aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "eks-sandbox-ebs-csi"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Environment" = "sandbox"
+           "Owner"       = "SRE"
+           "Product"     = "core"
+           "Service"     = "eks"
        }
+       unique_id             = (known after apply)
    }

  # module.irsa["ebs-csi"].aws_iam_role_policy_attachment.ebs_csi[0] will be created
+   resource "aws_iam_role_policy_attachment" "ebs_csi" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "eks-sandbox-ebs-csi"
    }

  # module.irsa["ext
```
</details>